read_verilog and_gate_non_synth.v
hierarchy -check -top and_gate_non_synth 
proc; opt; fsm; opt; memory; opt
techmap; op
dfflibmap -liberty /home/lab-user/Desktop/bootcamp-files/Tech-pdks/osu018/osu018_stdcells.lib
abc –liberty /home/lab-user/Desktop/bootcamp-files/Tech-pdks/osu018/osu018_stdcells.lib
clean 
show
write_verilog and_gate_netlist_non_synth.v
